app/views/entries/_entry.html.erb

SELECT 1 AS one FROM "comments" WHERE "comments"."entry_id" = ? ORDER BY created_at DESC LIMIT 1  [["entry_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = ? ORDER BY created_at DESC LIMIT 4 OFFSET 0  [["entry_id", 1]]
---

  <% if entry.comments.any? %>
    <h4>Comments (<%= entry.comments.count %>)</h4>
    <% @cmts = entry.comments.paginate(:page => params[:comment_page], :per_page => 4)%>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
---
                <span class="content">
                  <b><%= User.find(i.user_id).name %></b>