app/views/users/show.html.erb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? ORDER BY created_at DESC  [["user_id", 3]]
SELECT 1 AS one FROM "entries" WHERE "entries"."user_id" = ? ORDER BY created_at DESC LIMIT 1  [["user_id", 3]]
---
  <%= render 'follow_form' if signed_in? %>
    <% if @user.entries.any? %>