app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "entry_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "nbb"], ["created_at", Tue, 24 Dec 2013 17:38:56 UTC +00:00], ["entry_id", 1], ["updated_at", Tue, 24 Dec 2013 17:38:56 UTC +00:00], ["user_id", 2]]
---
  def create
    @comment = Comment.create(comment_params)