app/controllers/entries_controller.rb

INSERT INTO "entries" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "dsgrgtt"], ["created_at", Tue, 24 Dec 2013 04:07:28 UTC +00:00], ["title", "arewr"], ["updated_at", Tue, 24 Dec 2013 04:07:28 UTC +00:00], ["user_id", 3]]
---
  def create
    @entry = current_user.entries.build(entry_params)
    if @entry.save