app/controllers/static_pages_controller.rb

  def home
    if signed_in?
      @entry  = current_user.entries.build
     @feed_items = current_user.feed.paginate(page: params[:page], :per_page => 3)
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? ORDER BY created_at DESC  [["user_id", 3]]
SELECT COUNT(*) FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 3]]