app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
---
 def index
    @users = User.paginate(page: params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 3]]
SELECT COUNT(*) FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 3]]
---
  def show
    @user = User.find(params[:id])
    @entries = @user.entries.paginate(page: params[:page], :per_page => 4)